/* error description */
"Couldn’t parse METAR or TAF." = "Couldn’t parse METAR or TAF.";

/* failure reason */
"Invalid altimeter setting ‘%@’." = "Invalid altimeter setting ‘%@’.";

/* failure reason */
"Invalid conditions ‘%@’." = "Invalid conditions ‘%@’.";

/* failure reason */
"Invalid date ‘%@’." = "Invalid date ‘%@’.";

/* failure reason */
"Invalid forecast temperature ‘%@’" = "Invalid forecast temperature ‘%@’";

/* failure reason */
"Invalid icing ‘%@’" = "Invalid icing ‘%@’";

/* failure reason */
"Invalid low-level windshear ‘%@’." = "Invalid low-level windshear ‘%@’.";

/* failure reason */
"Invalid TAF period ‘%@’." = "Invalid TAF period ‘%@’.";

/* failure reason */
"Invalid temperature and dewpoint ‘%@’." = "Invalid temperature and dewpoint ‘%@’.";

/* failure reason */
"Invalid turbulence ‘%@’" = "Invalid turbulence ‘%@’";

/* failure reason */
"Invalid visibility ‘%@’." = "Invalid visibility ‘%@’.";

/* failure reason */
"Invalid weather ‘%@’." = "Invalid weather ‘%@’.";

/* failure reason */
"Invalid winds ‘%@’." = "Invalid winds ‘%@’.";

/* failure reason */
"METAR or TAF format is incorrect." = "METAR or TAF format is incorrect.";

/* failure reason */
"Unknown report type ‘%@’." = "Unknown report type ‘%@’.";

/* recovery suggestion */
"Verify the format of the METAR or TAF string." = "Verify the format of the METAR or TAF string.";

